{
  "posts": [
    {
      "id": 1,
      "slug": "risum",
      "title": "Risum - Projeto de TCC 2021",
      "cardText": "Uma rede social desenvolvida para dispositivos móveis, com ênfase na criação e compartilhamento de memes. O projeto já está disponível e à público. Foram utilizadas principalmente as tecnologias React Native, TypeScript e Google Firebase.",
      "paragraphs": [
        "Tivemos a ideia do Risum no ano de 2020, durante a pandemia, na tentativa de encontrar uma maneira de entreter os usuários online.",
        "O design do aplicativo e as suas funcionalidades oferecidas sofreram diversas alterações ao longo do tempo, até que a sua atual aparência e interface foram finalizadas com a conclusão do TCC em dezembro de 2021.",
        "Foi uma longa jornada até descobrirmos o potencial que a hiena poderia demonstrar aos seus usuários e desenvolvedores.",
        "Esperamos que gostem do App, a Risum Corporation agradece pelo seu apoio. Risos ;).",
        "OBS: Em breve traremos novidades ao aplicativo e seguiremos com seu desenvolvimento para deixá-lo ainda mais charmoso e atrativo para nossos usuários :D. Fiquem ligados no nosso repositório do GitHub (link no cabeçalho da página)."
      ],
      "thumbnail": "/images/posts/1-thumbnail.png",
      "cover": "/images/posts/1-cover.png"
    },

    {
      "id": 2,
      "slug": "bouncytrader",
      "title": "BouncyTrader - Plataforma para Investidores",
      "cardText": "Aplicativo simples que estima perdas e ganhos (PnL) com base nas operações diárias do usuário investidor",
      "paragraphs": [
        "Depois de estudar por algum tempo o mercado de investimentos, seja ele de ações, criptomoedas ou mesmo renda fixa, percebi que muitos não tem a noção de como calcular seus ganhos ou projetar o crescimento de seu patrimônio à longo prazo.",
        "Pensando nisso, decidi colocar esse projeto em prática juntamente ao @YesManic, no intuito de ajudar nos cálculos projetados para determinado período de investimento (e também para estudarmos juntos o desenvolvimento dessa aplicação na prática).",
        "Por exemplo, digamos que quero investir inicialmente R$50,00 e render essa quantia ao longo de 60 dias com uma porcentagem de lucro de 3% ao dia (imaginando que estejamos tratando do 'day trade'). Uma vez informados esses dados, o programa basicamente funcionará como uma calculadora de juros compostos, estimando o patrimônio final do usuário e os potenciais ganhos com as transações",
        "Além disso, pensamos em inserir também a cotação de diversas moedas exibidas em tempo real, no intuito de manter nossos usuários sempre preparados para possíveis negociações 🙂.",
        "O projeto ainda está em fase de desenvolvimento e pode ser acompanhado pelo GitHub (link no cabeçalho da página)."
      ],
      "thumbnail": "/images/posts/2-thumbnail.png",
      "cover": "/images/posts/2-cover.png"
    }
  ]
}
